; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v7)
             (pred_6 ?v10 ?v1)
             (pred_4 ?v8 ?v1)
             (pred_9 ?v9 ?v8 )
	     (pred_12 ?v8)
             (pred_5 ?v11)
             (pred_1 ?v10)
             (pred_7 ?v1)
             (pred_10 ?v8)
             (pred_8 ?v10)
             (pred_3 ?v8)
             (pred_11 ))



(:action op_1
:parameters (?v6 ?v13 ?v4 ?v3)
:precondition (and (pred_5 ?v6) (pred_5 ?v13) (pred_1 ?v4) (pred_7 ?v3)
          (pred_2 ?v6 ?v13) (pred_6 ?v4 ?v3)
                   (pred_4 ?v13 ?v3) (pred_12 ?v6) 
                   (pred_10 ?v13) (pred_8 ?v4))
:effect (and  (pred_3 ?v13) (not (pred_10 ?v13))))


(:action op_5
:parameters (?v6 ?v5)
:precondition (and (pred_5 ?v6) (pred_5 ?v5)
               (pred_12 ?v6) (pred_2 ?v6 ?v5) (pred_3 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v6))))

(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_5 ?v6) (pred_1 ?v4) 
                  (pred_12 ?v6) (pred_9 ?v4 ?v6) (pred_11 ))
:effect (and (pred_8 ?v4)
   (not (pred_9 ?v4 ?v6)) (not (pred_11 ))))


(:action op_3
:parameters (?v6 ?v2 ?v12)
:precondition (and (pred_5 ?v6) (pred_1 ?v2) (pred_1 ?v12)
                  (pred_12 ?v6) (pred_8 ?v12) (pred_9 ?v2 ?v6))
:effect (and (pred_8 ?v2) (pred_9 ?v12 ?v6)
        (not (pred_8 ?v12)) (not (pred_9 ?v2 ?v6))))

(:action op_2
:parameters (?v6 ?v4)
:precondition (and (pred_5 ?v6) (pred_1 ?v4) 
                  (pred_12 ?v6) (pred_8 ?v4))
:effect (and (pred_11 ) (pred_9 ?v4 ?v6) (not (pred_8 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_27 obj_24 obj_23 obj_09 obj_07 obj_17 obj_18 obj_28 obj_02 obj_08 obj_19 obj_06 obj_05 obj_11 obj_22 obj_25 obj_26 obj_01 obj_14 obj_21 obj_03 obj_29 obj_15 obj_30
    obj_04 obj_31 obj_20
    obj_13 obj_12 obj_10
    )

    (:init
       (pred_11)

       (pred_5 obj_16)
       (pred_5 obj_27)
       (pred_5 obj_24)
       (pred_5 obj_23)
       (pred_5 obj_09)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_28)
       (pred_5 obj_02)
       (pred_5 obj_08)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_11)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_26)
       (pred_5 obj_01)
       (pred_5 obj_14)
       (pred_5 obj_21)
       (pred_5 obj_03)
       (pred_5 obj_29)
       (pred_5 obj_15)
       (pred_5 obj_30)
       (pred_7 obj_04)
       (pred_7 obj_31)
       (pred_7 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_10)

       (pred_2 obj_16 obj_07)
       (pred_2 obj_16 obj_27)
       (pred_2 obj_27 obj_17)
       (pred_2 obj_27 obj_24)
       (pred_2 obj_27 obj_16)
       (pred_2 obj_24 obj_18)
       (pred_2 obj_24 obj_23)
       (pred_2 obj_24 obj_27)
       (pred_2 obj_23 obj_28)
       (pred_2 obj_23 obj_09)
       (pred_2 obj_23 obj_24)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_23)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_17)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_27)
       (pred_2 obj_17 obj_07)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_18 obj_28)
       (pred_2 obj_18 obj_24)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_28 obj_05)
       (pred_2 obj_28 obj_02)
       (pred_2 obj_28 obj_23)
       (pred_2 obj_28 obj_18)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_28)
       (pred_2 obj_08 obj_22)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_19 obj_25)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_06 obj_26)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_18)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_05 obj_01)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_28)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_22 obj_21)
       (pred_2 obj_22 obj_25)
       (pred_2 obj_22 obj_08)
       (pred_2 obj_25 obj_03)
       (pred_2 obj_25 obj_26)
       (pred_2 obj_25 obj_19)
       (pred_2 obj_25 obj_22)
       (pred_2 obj_26 obj_29)
       (pred_2 obj_26 obj_01)
       (pred_2 obj_26 obj_06)
       (pred_2 obj_26 obj_25)
       (pred_2 obj_01 obj_15)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_01 obj_05)
       (pred_2 obj_01 obj_26)
       (pred_2 obj_14 obj_30)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_21 obj_22)
       (pred_2 obj_03 obj_29)
       (pred_2 obj_03 obj_25)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_29 obj_15)
       (pred_2 obj_29 obj_26)
       (pred_2 obj_29 obj_03)
       (pred_2 obj_15 obj_30)
       (pred_2 obj_15 obj_01)
       (pred_2 obj_15 obj_29)
       (pred_2 obj_30 obj_14)
       (pred_2 obj_30 obj_15)
       (pred_10 obj_05)
       (pred_10 obj_24)
       (pred_10 obj_01)
       (pred_4  obj_05 obj_04)
       (pred_4  obj_24 obj_31)
       (pred_4  obj_01 obj_20)
       (pred_3 obj_16)
       (pred_3 obj_27)
       (pred_3 obj_23)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_18)
       (pred_3 obj_28)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_3 obj_22)
       (pred_3 obj_25)
       (pred_3 obj_26)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_03)
       (pred_3 obj_29)
       (pred_3 obj_15)
       (pred_3 obj_30)

       (pred_6  obj_13 obj_04)
       (pred_6  obj_12 obj_31)
       (pred_6  obj_10 obj_20)
       (pred_9 obj_13 obj_27)
       (pred_9 obj_12 obj_07)
       (pred_9 obj_10 obj_22)
       (pred_12 obj_06)
    )

    (:goal (and
       (pred_9 obj_13 obj_26)
       (pred_9 obj_12 obj_03)
    ))
(:constraints
  (always (not (pred_12 obj_17)))
)
)

; plan
1. (op_5 obj_06 obj_19)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_08)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_08)
   goals met: 0 of 2
3. (op_5 obj_08 obj_07)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_07)
   goals met: 0 of 2
4. (op_4 obj_07 obj_12)
   deleted: (pred_9 obj_12 obj_07) (pred_11)
   added: (pred_8 obj_12)
   goals met: 0 of 2
5. (op_5 obj_07 obj_08)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_08)
   goals met: 0 of 2
6. (op_5 obj_08 obj_19)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_19)
   goals met: 0 of 2
7. (op_5 obj_19 obj_25)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_25)
   goals met: 0 of 2
8. (op_5 obj_25 obj_03)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_03)
   goals met: 0 of 2
9. (op_2 obj_03 obj_12)
   deleted: (pred_8 obj_12)
   added: (pred_11) (pred_9 obj_12 obj_03)
   goals met: 1 of 2
10. (op_5 obj_03 obj_25)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_25)
   goals met: 1 of 2
11. (op_5 obj_25 obj_19)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_19)
   goals met: 1 of 2
12. (op_5 obj_19 obj_08)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_08)
   goals met: 1 of 2
13. (op_5 obj_08 obj_07)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_07)
   goals met: 1 of 2
14. (op_5 obj_07 obj_16)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_16)
   goals met: 1 of 2
15. (op_5 obj_16 obj_27)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_27)
   goals met: 1 of 2
16. (op_4 obj_27 obj_13)
   deleted: (pred_9 obj_13 obj_27) (pred_11)
   added: (pred_8 obj_13)
   goals met: 1 of 2
17. (op_5 obj_27 obj_16)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_16)
   goals met: 1 of 2
18. (op_5 obj_16 obj_07)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_07)
   goals met: 1 of 2
19. (op_5 obj_07 obj_08)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_08)
   goals met: 1 of 2
20. (op_5 obj_08 obj_19)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_19)
   goals met: 1 of 2
21. (op_5 obj_19 obj_06)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_06)
   goals met: 1 of 2
22. (op_5 obj_06 obj_26)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_26)
   goals met: 1 of 2
23. (op_2 obj_26 obj_13)
   deleted: (pred_8 obj_13)
   added: (pred_11) (pred_9 obj_13 obj_26)
   goals met: 2 of 2
